<template>
    <v-page-static :options="options">
        <v-tabs default-active="one">
            <v-tab-panel label="一致性" name="one">
                与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；<br/>
                在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </v-tab-panel>
            <v-tab-panel label="反馈">
                控制反馈：通过界面样式和交互动效让用户可以清晰的感知自己的操作；<br/>
                页面反馈：操作后，通过页面元素的变化清晰地展现当前状态。
            </v-tab-panel>
            <v-tab-panel label="效率">
                简化流程：设计简洁直观的操作流程；<br/>
                清晰明确：语言表达清晰且表意明确，让用户快速理解进而作出决策；<br/>
                帮助用户识别：界面简单直白，让用户快速识别而非回忆，减少用户记忆负担。
            </v-tab-panel>
            <v-tab-panel label="可控">
                用户决策：根据场景可给予用户操作建议或安全提示，但不能代替用户进行决策；<br/>
                结果可控：用户可以自由的进行操作，包括撤销、回退和终止当前操作等。
            </v-tab-panel>
        </v-tabs>
        <v-tabs default-active="1" type="scroll" class="_v1">
            <v-tab-panel label="一致性">
                与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；<br/>
                在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </v-tab-panel>
            <v-tab-panel label="反馈">
                控制反馈：通过界面样式和交互动效让用户可以清晰的感知自己的操作；<br/>
                页面反馈：操作后，通过页面元素的变化清晰地展现当前状态。
            </v-tab-panel>
            <v-tab-panel label="效率">
                简化流程：设计简洁直观的操作流程；<br/>
                清晰明确：语言表达清晰且表意明确，让用户快速理解进而作出决策；<br/>
                帮助用户识别：界面简单直白，让用户快速识别而非回忆，减少用户记忆负担。
            </v-tab-panel>
            <v-tab-panel label="可控">
                用户决策：根据场景可给予用户操作建议或安全提示，但不能代替用户进行决策；<br/>
                结果可控：用户可以自由的进行操作，包括撤销、回退和终止当前操作等。
            </v-tab-panel>
            <v-tab-panel label="高效贴心">
                一秒钟等待：减少等待、稳定快捷，才能帮你留住用户。许多研究都表明，用户能够忍受的最长等待时间的中位数，在 6～8 秒之间。这就是说，8 秒是一个临界值，如果你的页面打开速度过慢，等待 8 秒以上，大部分用户会离你而去。<br/>
                转移注意力：转移注意力是减轻等待的负面影响的常用手段。其实，在现实生活中我们就尝试使用转移注意力的方法。比如：一些服务较好的饭店，在客人排队等待就餐的时候提供各种小吃和休闲游戏，客人有好吃的、好玩的就完全忘记了等待的烦恼。 这种方式在应用的设计中也同样管用。<br/>
                一次点击：产品在使用过程中经常会有一些多余的点击，对于用户而言，这些不必要的操作都是附加工作。附加工作消耗用户的精力，但是不直接实现用户的目标。消除附加工作，可以提升操作效率，改善产品的可用性。交互设计师应该对产品中附加工作高度敏感，才能把产品设计得更高效。<br/>
                减少输入：由于手机键盘区域小且密集，输入困难还易引起输入错误，因此在设计手机端页面时应尽量减少用户输入，利用现有接口或其他一些容易操作的选择控件来改善用户输入的体验。<br/>
                反馈明确：及时恰当的反馈能告诉用户下一步该做什么，帮助用户做出判断和决定，让用户知道系统运行良好稳定。所以，要营造和谐的人机对话环境，我们必须做到适时明确的反馈。
            </v-tab-panel>
            <v-tab-panel label="安全可控">
                信息脱敏：很多应用和服务都需要填入或者展示用户的某些私密信息，如：账户密码、手机号、身份证号、银行卡号等。展示和输入的时候对这些信息进行脱敏处理，隐藏信息的某一部分，而不是完全暴露在外。这样会让用户感觉到你的用心，你在保护他的信息安全。<br/>
                输入提示：要求用户输入敏感信息的时候，明确告知用户信息的用途，消除用户的顾虑。<br/>
                展示权威：如果你服务提供方是传统的渠道非常有权威，在线上还不是广为人知。那么为了快速赢得用户的信任，打消顾虑，你可以向用户展示已有的权威。<br/>
                操作可控：我们作为服务提供者，应该坚守服务者的立场。时刻谨记是用户控制应用，而不是应用控制用户，不要冒然替用户做决定。 好设计应该是值得信任，也容易被相信的。在要求用户执行某一动作的时候，尽一切努力帮他们理解为什么这个操作是必要的。每一步都需要借助诚实和清晰的表述来建立信任，逐步的积累，一点点提升用户的信任感。建立信任的基础就是用户自己拥有控制权！<br/>
                二次确认：为了让用户感觉到是他们在控制，应用应该使用熟悉且可预知的交互元素。同时，在用户进行具有破坏性的操作行为的时候，提供二次确认，避免造成不可挽回的损失。<br/>
            </v-tab-panel>
        </v-tabs>
    </v-page-static>
</template>
<script type="text/babel">
    import { vPage, vPageStatic } from '../../plugin/common/components/page'
    import { vTabs, vTabPanel } from '../../plugin/common/components/tabs'
    import $log from '../../plugin/common/services/log'
    export default {
        components: {
            vPage,
            vPageStatic,
            vTabs,
            vTabPanel
        },
        data (){
            return {
                options: {
                    title: {
                        value: '标签页',
                    },
                }
            }
        }
    }
</script>
